AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt101x/cpu/include/driver/flexspi/imx1010_flexspi_regs.h
/* Serial Flash CS Hold time */
#define __FLEXSPI_FLSHCR1_TCSH_SHIFT                5
#define __FLEXSPI_FLSHCR1_TCSH(x)                  (((x) & 0x1F) << __FLEXSPI_FLSHCR1_TCSH_SHIFT)

/* Word Addressable */
#define __FLEXSPI_FLSHCR1_WA_SHIFT                  10
#define __FLEXSPI_FLSHCR1_WA(x)                    (((x) & 0x1) << __FLEXSPI_FLSHCR1_WA_SHIFT)

/* Column Address Size */
#define __FLEXSPI_FLSHCR1_CAS_SHIFT                 11
#define __FLEXSPI_FLSHCR1_CAS(x)                   (((x) & 0xF) << __FLEXSPI_FLSHCR1_CAS_SHIFT)

/* CS interval unit */
#define __FLEXSPI_FLSHCR1_CSINTERVALUNIT_SHIFT      15
#define __FLEXSPI_FLSHCR1_CSINTERVALUNIT(x)        (((x) & 0x1) << __FLEXSPI_FLSHCR1_CSINTERVALUNIT_SHIFT)

/*
 * set the minimum interval between flash device Chip selection deassertion and
 * flash device Chip selection assertion
 */
#define __FLEXSPI_FLSHCR1_CSINTERVAL_SHIFT          16
#define __FLEXSPI_FLSHCR1_CSINTERVAL(x)            (((x) & 0xFFFF) << __FLEXSPI_FLSHCR1_CSINTERVAL_SHIFT)


/*******************************************************************************
  Flash a Control Register 2
*******************************************************************************/

/* Sequence Index for AHB Read triggered Command in LUT */
#define __FLEXSPI_FLSHCR2_ARDSEQID_SHIFT            0
#define __FLEXSPI_FLSHCR2_ARDSEQID(x)              (((x) & 0xF) << __FLEXSPI_FLSHCR2_ARDSEQID_SHIFT)

/* Sequence Number for AHB Read triggered Command in LUT */
#define __FLEXSPI_FLSHCR2_ARDSEQNUM_SHIFT           5
#define __FLEXSPI_FLSHCR2_ARDSEQNUM(x)             (((x) & 0x7) << __FLEXSPI_FLSHCR2_ARDSEQNUM_SHIFT)

/* Sequence Index for AHB Write triggered Command */
#define __FLEXSPI_FLSHCR2_AWRSEQID_SHIFT            8
#define __FLEXSPI_FLSHCR2_AWRSEQID(x)              (((x) & 0xF) << __FLEXSPI_FLSHCR2_AWRSEQID_SHIFT)

/* Sequence Number for AHB Write triggered Command */
#define __FLEXSPI_FLSHCR2_AWRSEQNUM_SHIFT           13
#define __FLEXSPI_FLSHCR2_AWRSEQNUM(x)             (((x) & 0x7) << __FLEXSPI_FLSHCR2_AWRSEQNUM_SHIFT)

/* AHB write wait interval */
#define __FLEXSPI_FLSHCR2_AWRWAIT_SHIFT             16
#define __FLEXSPI_FLSHCR2_AWRWAIT(x)               (((x) & 0xFFF) << __FLEXSPI_FLSHCR2_AWRWAIT_SHIFT)

/* AHB write wait unit */
#define __FLEXSPI_FLSHCR2_AWRWAITUNIT_SHIFT         28
#define __FLEXSPI_FLSHCR2_AWRWAITUNIT(x)           (((x) & 0x7) << __FLEXSPI_FLSHCR2_AWRWAITUNIT_SHIFT)

/* Clear the instruction pointer which is internally saved pointer by JMP_ON_CS */
#define __FLEXSPI_FLSHCR2_CLRINSTRPTR_SHIFT         31
#define __FLEXSPI_FLSHCR2_CLRINSTRPTR(x)           (((x) & 0x1) << __FLEXSPI_FLSHCR2_CLRINSTRPTR_SHIFT)

/*******************************************************************************
  LUT Register
*******************************************************************************/

/* OPERAND0 */
#define __FLEXSPI_LUT_OPERAND0_SHIFT                0
#define __FLEXSPI_LUT_OPERAND0(x)                  (((x) & 0xFF) << __FLEXSPI_LUT_OPERAND0_SHIFT)

/* NUM_PADS0 */
#define __FLEXSPI_LUT_NUM_PADS0_SHIFT               8
#define __FLEXSPI_LUT_NUM_PADS0(x)                 (((x) & 0x3) << __FLEXSPI_LUT_NUM_PADS0_SHIFT)

/* OPCODE0 */
#define __FLEXSPI_LUT_OPCODE0_SHIFT                 10
#define __FLEXSPI_LUT_OPCODE0(x)                   (((x) & 0x3F) << __FLEXSPI_LUT_OPCODE0_SHIFT)

/* OPERAND1 */
#define __FLEXSPI_LUT_OPERAND1_SHIFT                16
#define __FLEXSPI_LUT_OPERAND1(x)                  (((x) & 0xFF) << __FLEXSPI_LUT_OPERAND1_SHIFT)

/* NUM_PADS1 */
#define __FLEXSPI_LUT_NUM_PADS1_SHIFT               24
#define __FLEXSPI_LUT_NUM_PADS1(x)                 (((x) & 0x3) << __FLEXSPI_LUT_NUM_PADS1_SHIFT)

/* OPCODE1 */
#define __FLEXSPI_LUT_OPCODE1_SHIFT                 26
#define __FLEXSPI_LUT_OPCODE1(x)                   (((x) & 0x3F) << __FLEXSPI_LUT_OPCODE1_SHIFT)


/*******************************************************************************
  Interrupt Enable Register
*******************************************************************************/

/* IP triggered Command Sequences Execution finished interrupt enable. */
#define __FLEXSPI_INTEN_IPCMDDONEEN_SHIFT           0
#define __FLEXSPI_INTEN_IPCMDDONEEN_MASK           (0x1 << __FLEXSPI_INTEN_IPCMDDONEEN_SHIFT)

/* IP triggered Command Sequences Grant Timeout interrupt enable. */
#define __FLEXSPI_INTEN_IPCMDGEEN_SHIFT             1
#define __FLEXSPI_INTEN_IPCMDGEEN_MASK             (0x1 << __FLEXSPI_INTEN_IPCMDGEEN_SHIFT)

/* AHB triggered Command Sequences Grant Timeout interrupt enable. */
#define __FLEXSPI_INTEN_AHBCMDGEEN_SHIFT            2
#define __FLEXSPI_INTEN_AHBCMDGEEN_MASK            (0x1 << __FLEXSPI_INTEN_AHBCMDGEEN_SHIFT)

/* IP triggered Command Sequences Error Detected interrupt enable. */
#define __FLEXSPI_INTEN_IPCMDERREN_SHIFT            3
#define __FLEXSPI_INTEN_IPCMDERREN_MASK            (0x1 << __FLEXSPI_INTEN_IPCMDERREN_SHIFT)

/* AHB triggered Command Sequences Error Detected interrupt enable. */
#define __FLEXSPI_INTEN_AHBCMDERREN_SHIFT           4
#define __FLEXSPI_INTEN_AHBCMDERREN_MASK           (0x1 << __FLEXSPI_INTEN_AHBCMDERREN_SHIFT)

/* IP RX FIFO WaterMark available interrupt enable. */
#define __FLEXSPI_INTEN_IPRXWAEN_SHIFT              5
#define __FLEXSPI_INTEN_IPRXWAEN_MASK              (0x1 << __FLEXSPI_INTEN_IPRXWAEN_SHIFT)

/* IP TX FIFO WaterMark empty interrupt enable. */
#define __FLEXSPI_INTEN_IPTXWEEN_SHIFT              6
#define __FLEXSPI_INTEN_IPTXWEEN_MASK              (0x1 << __FLEXSPI_INTEN_IPTXWEEN_SHIFT)

/* AHB Bus timeout interrupt.Refer Interrupts chapter for more details. */
#define __FLEXSPI_INTEN_AHBBUSTIMEOUTEN_SHIFT       10
#define __FLEXSPI_INTEN_AHBBUSTIMEOUTEN_MASK       (0x1 << __FLEXSPI_INTEN_AHBBUSTIMEOUTEN_SHIFT)

/* Sequence execution timeout interrupt enable.Refer Interrupts chapter for more details. */
#define __FLEXSPI_INTEN_SEQTIMEOUTEN_SHIFT          11
#define __FLEXSPI_INTEN_SEQTIMEOUTEN_MASK          (0x1 << __FLEXSPI_INTEN_SEQTIMEOUTEN_SHIFT)


