AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt101x/cpu/include/driver/flexspi/imx1010_flexspi_regs.h
/*******************************************************************************
  Interrupt Register
*******************************************************************************/

/* IP triggered Command Sequences Execution finished interrupt. */
#define __FLEXSPI_INTR_IPCMDDONE_MASK               0x1u
#define __FLEXSPI_INTR_IPCMDDONE_SHIFT              0

/* IP triggered Command Sequences Grant Timeout interrupt */
#define __FLEXSPI_INTR_IPCMDGE_MASK                 0x2u
#define __FLEXSPI_INTR_IPCMDGE_SHIFT                1

/* AHB triggered Command Sequences Grant Timeout interrupt */
#define __FLEXSPI_INTR_AHBCMDGE_MASK                0x4u
#define __FLEXSPI_INTR_AHBCMDGE_SHIFT               2

/* IP triggered Command Sequences Error Detected interrupt */
#define __FLEXSPI_INTR_IPCMDERR_MASK                0x8u
#define __FLEXSPI_INTR_IPCMDERR_SHIFT               3

/* AHB triggered Command Sequences Error Detected interrupt */
#define __FLEXSPI_INTR_AHBCMDERR_MASK               0x10u
#define __FLEXSPI_INTR_AHBCMDERR_SHIFT              4

/* IP RX FIFO watermark available interrupt */
#define __FLEXSPI_INTR_IPRXWA_MASK                  0x20u
#define __FLEXSPI_INTR_IPRXWA_SHIFT                 5

/* IP TX FIFO watermark empty interrupt */
#define __FLEXSPI_INTR_IPTXWE_MASK                  0x40u
#define __FLEXSPI_INTR_IPTXWE_SHIFT                 6

/* AHB Bus timeout interrupt.Refer Interrupts chapter for more details */
#define __FLEXSPI_INTR_AHBBUSTIMEOUT_MASK           0x400u
#define __FLEXSPI_INTR_AHBBUSTIMEOUT_SHIFT          10

/* Sequence execution timeout interrupt */
#define __FLEXSPI_INTR_SEQTIMEOUT_MASK              0x800u
#define __FLEXSPI_INTR_SEQTIMEOUT_SHIFT             11


/*******************************************************************************
  IP RX FIFO Control Register
*******************************************************************************/

/* Clear all valid data entries in IP TX FIFO */
#define __FLEXSPI_IPTXFCR_CLRIPTXF_SHIFT            0


/*******************************************************************************
  IP TX FIFO Control Register
*******************************************************************************/

/* Clear all valid data entries in IP RX FIFO */
#define __FLEXSPI_IPRXFCR_CLRIPRXF_SHIFT            0

/*******************************************************************************
  IP Control Register 1
*******************************************************************************/

/* Flash Read/Program Data Size (in Bytes) for IP command */
#define __FLEXSPI_IPCR1_IDATSZ_SHIFT                0
#define __FLEXSPI_IPCR1_IDATSZ(x)                  (((x) & 0xFFFF) << __FLEXSPI_IPCR1_IDATSZ_SHIFT)

/* Sequence Index in LUT for IP command */
#define __FLEXSPI_IPCR1_ISEQID_SHIFT                16
#define __FLEXSPI_IPCR1_ISEQID(x)                  (((x) & 0xF) << __FLEXSPI_IPCR1_ISEQID_SHIFT)

/* Sequence Number for IP command: ISEQNUM+1 */
#define __FLEXSPI_IPCR1_ISEQNUM_SHIFT               24
#define __FLEXSPI_IPCR1_ISEQNUM(x)                 (((x) & 0x7) << __FLEXSPI_IPCR1_ISEQNUM_SHIFT)

/* Parallel mode Enabled for IP command */
#define __FLEXSPI_IPCR1_IPAREN_SHIFT                31
#define __FLEXSPI_IPCR1_IPAREN(x)                  (((x) & 0x1) << __FLEXSPI_IPCR1_IPAREN_SHIFT)

/*******************************************************************************
  IP TX FIFO Control Register
*******************************************************************************/

/* Clear all valid data entries in IP TX FIFO */
#define __FLEXSPI_IPTXFCR_CLRIPTXF_SHIFT            0
#define __FLEXSPI_IPTXFCR_CLRIPTXF_MASK            (0x1 << __FLEXSPI_IPTXFCR_CLRIPTXF_SHIFT)

/* IP TX FIFO filling by DMA enabled  */
#define __FLEXSPI_IPTXFCR_TXDMAEN_SHIFT             1
#define __FLEXSPI_IPTXFCR_TXDMAEN_MASK             (0x1 << __FLEXSPI_IPTXFCR_TXDMAEN_SHIFT)

/* Watermark level is (TXWMRK+1)*64 Bits */
#define __FLEXSPI_IPTXFCR_TXWMRK_SHIFT              2
#define __FLEXSPI_IPTXFCR_TXWMRK(x)                (((x) & 0xF) << __FLEXSPI_IPTXFCR_TXWMRK_SHIFT)

/*******************************************************************************
  IP RX FIFO Control Register
*******************************************************************************/

/* Clear all valid data entries in IP RX FIFO */
#define __FLEXSPI_IPRXFCR_CLRIPRXF_SHIFT            0
#define __FLEXSPI_IPRXFCR_CLRIPRXF_MASK            (0x1 << __FLEXSPI_IPTXFCR_CLRIPTXF_SHIFT)

/* IP RX FIFO reading by DMA enabled. */
#define __FLEXSPI_IPRXFCR_RXDMAEN_SHIFT             1
#define __FLEXSPI_IPRXFCR_RXDMAEN_MASK             (0x1 << __FLEXSPI_IPTXFCR_TXDMAEN_SHIFT)

/* Watermark level is (RXWMRK+1)*64 Bits */
#define __FLEXSPI_IPRXFCR_RXWMRK_SHIFT              2
#define __FLEXSPI_IPRXFCR_RXWMRK(x)                (((x) & 0xF) << __FLEXSPI_IPTXFCR_TXWMRK_SHIFT)


/*******************************************************************************
  IP RX FIFO Status Register
*******************************************************************************/

/* Fill level of IP RX FIFO */
#define __FLEXSPI_IPRXFSTS_FILL_SHIFT            0
#define __FLEXSPI_IPRXFSTS_FILL_MASK            (0xFF << __FLEXSPI_IPRXFSTS_FILL_SHIFT)

/* Total Read Data Counter: RDCNTR * 64 Bits */
#define __FLEXSPI_IPRXFSTS_RDCNTR_SHIFT          16
#define __FLEXSPI_IPRXFSTS_RDCNTR_MASK          (0xFFFF << __FLEXSPI_IPRXFSTS_RDCNTR_SHIFT)

/*******************************************************************************
  DLL Control Register
*******************************************************************************/

/* DLL calibration enable */
#define __FLEXSPI_DLLCR_DLLEN_SHIFT               0
#define __FLEXSPI_DLLCR_DLLEN_MASK               (0x1 << __FLEXSPI_DLLCR_DLLEN_SHIFT)

/* Software could force a reset on DLL by setting this field to 0x1 */
#define __FLEXSPI_DLLCR_DLLRESET_SHIFT            1
#define __FLEXSPI_DLLCR_DLLRESET_MASK            (0x1 << __FLEXSPI_DLLCR_DLLRESET_SHIFT)

/*
 * The delay target for slave delay line is: ((SLVDLYTARGET+1) * 1/32 * clock cycle
 * of reference clock
 */
#define __FLEXSPI_DLLCR_SLVDLYTARGET_SHIFT        3
#define __FLEXSPI_DLLCR_SLVDLYTARGET(x)          (((x) & 0xF) << __FLEXSPI_DLLCR_SLVDLYTARGET_SHIFT)

/* Slave clock delay line delay cell number selection override enable */
#define __FLEXSPI_DLLCR_OVRDEN_SHIFT              8
#define __FLEXSPI_DLLCR_OVRDEN_MASK              (0x1 << __FLEXSPI_DLLCR_OVRDEN_SHIFT)

/* Slave clock delay line delay cell number selection override value */
#define __FLEXSPI_DLLCR_OVRDVAL_SHIFT             9
#define __FLEXSPI_DLLCR_OVRDVAL(x)               (((x) & 0x3F) << __FLEXSPI_DLLCR_OVRDVAL_SHIFT)

/*******************************************************************************
  Flash Control Register 4
*******************************************************************************/

#define FLEXSPI_FLSHCR4_WMENA_SHIFT               2
#define FLEXSPI_FLSHCR4_WMENA_MASK               (0x1 << FLEXSPI_FLSHCR4_WMENA_SHIFT)

/*******************************************************************************
  Flash Status Register 0
*******************************************************************************/
#define FLEXSPI_STATUS0_ARBIDLE_MASK              0x2
#define FLEXSPI_STATUS0_SEQIDLE_MASK              0x1

#endif /* __IMX1010_LPSPI_REGS_H */

/* end of file */
